//包含标准输入输出函数
#include <stdio.h>
//定义main函数
int main()
{
    //请在此添加‘奖金发放’的代码,预期格式如下，可改动。 
    /*****************Begin******************/
    double I, x = 0;
    int m;
    scanf_s("%lf", &I);
    if (I <= 100000)
        m = 1;
    else if (I <= 200000)
        m = 2;
    else if (I <= 400000)
        m = 3;
    else if (I <= 600000)
        m = 4;
    else if (I <= 1000000)
        m = 5;
    else
        m = 6;

    switch (m) {
    case 1:
        x = I * 0.1; break;
    case 2:
        x = (I - 100000) * 0.075 + 100000 * 0.1; break;
    case 3:
        x = (I - 200000) * 0.05 + 100000 * 0.1 + 100000 * 0.075; break;
    case 4:
        x = (I - 400000) * 0.03 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05; break;
    case 5:
        x = (I - 600000) * 0.015 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03; break;
    case 6:
        x = (I - 1000000) * 0.01 + 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015; break;
    default:
        break;
    }
    printf("%.2lf", x);
    /***************** End ******************/
    return 0;
}
